; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   sinkbasintype fridgetype microwavetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   tvstandtype cabinettype safetype carttype diningtabletype - receptacletype
   toiletpapertype kettletype boxtype dishspongetype pottype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 - location
   tvstand_1 cabinet_2 safe_3 cart_4 diningtable_5 microwave_6 fridge_7 - receptacle
   toiletpaper_1 kettle_2 box_3 dishsponge_4 pot_5 - obj
 )
 (:init (receptacletype_0 tvstand_1 tvstandtype) (receptacletype_0 cabinet_2 cabinettype) (receptacletype_0 safe_3 safetype) (receptacletype_0 cart_4 carttype) (receptacletype_0 diningtable_5 diningtabletype) (receptacletype_0 microwave_6 microwavetype) (receptacletype_0 fridge_7 fridgetype) (objecttype_0 toiletpaper_1 toiletpapertype) (objecttype_0 kettle_2 kettletype) (objecttype_0 box_3 boxtype) (objecttype_0 dishsponge_4 dishspongetype) (objecttype_0 pot_5 pottype) (cancontain cabinettype toiletpapertype) (cancontain cabinettype kettletype) (cancontain cabinettype boxtype) (cancontain cabinettype dishspongetype) (cancontain cabinettype pottype) (cancontain carttype toiletpapertype) (cancontain carttype dishspongetype) (cancontain diningtabletype toiletpapertype) (cancontain diningtabletype kettletype) (cancontain diningtabletype boxtype) (cancontain diningtabletype dishspongetype) (cancontain diningtabletype pottype) (cancontain fridgetype pottype) (pickupable toiletpaper_1) (pickupable kettle_2) (cleanable kettle_2) (pickupable box_3) (isreceptacleobject box_3) (pickupable dishsponge_4) (cleanable dishsponge_4) (pickupable pot_5) (isreceptacleobject pot_5) (cleanable pot_5) (coolable pot_5) (receptacleatlocation tvstand_1 location2) (receptacleatlocation cabinet_2 location3) (receptacleatlocation safe_3 location4) (receptacleatlocation cart_4 location2) (receptacleatlocation diningtable_5 location2) (receptacleatlocation microwave_6 location5) (receptacleatlocation fridge_7 location3) (inreceptacle toiletpaper_1 diningtable_5) (inreceptacle kettle_2 diningtable_5) (inreceptacle box_3 cabinet_2) (inreceptacle dishsponge_4 cabinet_2) (inreceptacle pot_5 cabinet_2) (objectatlocation toiletpaper_1 location2) (objectatlocation kettle_2 location2) (objectatlocation box_3 location3) (objectatlocation dishsponge_4 location3) (objectatlocation pot_5 location3) (atlocation agent1 location5) (= (total-cost) 0))
 (:goal (and (exists (?r - receptacle)
 (exists (?o - obj)
 (and (inreceptacle ?o ?r) (objecttype_0 ?o dishspongetype) (receptacletype_0 ?r diningtabletype))))))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location5 location3)
   deleted: (atlocation agent1 location5)
   added: (atlocation agent1 location3)
   goals met: 0 of 1
2. (pickupobject agent1 location3 dishsponge_4 cabinet_2)
   deleted: (inreceptacle dishsponge_4 cabinet_2) (objectatlocation dishsponge_4 location3)
   added: (holds agent1 dishsponge_4) (holdsany agent1)
   goals met: 0 of 1
3. (gotolocation agent1 location3 location2)
   deleted: (atlocation agent1 location3)
   added: (atlocation agent1 location2)
   goals met: 0 of 1
4. (putobject agent1 location2 dishsponge_4 diningtable_5 dishspongetype diningtabletype)
   deleted: (holds agent1 dishsponge_4) (holdsany agent1)
   added: (inreceptacle dishsponge_4 diningtable_5) (objectatlocation dishsponge_4 location2)
   goals met: 1 of 1
